# ALL SAWS DATA

- grabbing all data and putting into one dataframe to see usage by areas of san antonio

## Imports

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
# Read in all excels
df1 = pd.read_excel('s1.xlsx')

In [3]:
df2 = pd.read_excel('s2.xlsx')

In [4]:
df3 = pd.read_excel('s3.xlsx')

In [5]:
df1.head()

,Record #,Prefix,Service Location,Suffix,ZIP Code,17-JAN,17-FEB,17-MAR,17-APR,17-MAY,...,20-MAR,20-APR,20-MAY,20-JUN,20-JUL,20-AUG,20-SEP,20-OCT,20-NOV,20-DEC
0,1,NaN,2ND,ST,78221,4489,5237,4489,4489,5985,...,2244,3740,3740,2992,5237,5237,2244,3740,3740,2992
1,2,NaN,2ND,ST,78221,0,0,0,0,0,...,8229,6733,8977,10473,18702,11222,11222,8977,8229,11222
2,3,NaN,2ND,ST,78221,9725,10473,7481,7481,9725,...,6733,5237,6733,7481,8229,9725,10473,9725,8977,7481
3,4,NaN,2ND,ST,78221,2992,4489,748,1496,748,...,2244,2244,2992,2992,2992,2992,2992,2992,2244,2992
4,5,NaN,2ND,ST,78221,5237,5237,4489,5237,4489,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df2.head()

,Record #,Prefix,Service Location,Suffix,ZIP Code,17-JAN,17-FEB,17-MAR,17-APR,17-MAY,...,20-MAR,20-APR,20-MAY,20-JUN,20-JUL,20-AUG,20-SEP,20-OCT,20-NOV,20-DEC
0,273591,NaN,ABACUS,DR,78224,2244,2244,1496,2244,2244,...,1496,2992,2244,748,3740,2244,1496,2244,2244,2244
1,273592,NaN,ABACUS,DR,78224,2244,1496,2244,2992,3740,...,2244,2244,2244,2992,2992,1496,2244,3740,2244,2244
2,273593,NaN,ABACUS,DR,78224,6733,4489,3740,4489,7481,...,2244,3740,5237,3740,4489,4489,8229,4489,4489,3740
3,273594,NaN,ABACUS,DR,78224,5237,4489,5237,4489,5237,...,11222,13466,13466,14214,14962,8229,5985,6733,*,NaN
4,273595,NaN,ABACUS,DR,78224,5237,5237,5985,6733,5985,...,4489,2992,3740,4489,2992,0,0,NaN,NaN,NaN

In [7]:
df3.head()

,Record #,Prefix,Service Location,Suffix,ZIP Code,17-JAN,17-FEB,17-MAR,17-APR,17-MAY,...,20-MAR,20-APR,20-MAY,20-JUN,20-JUL,20-AUG,20-SEP,20-OCT,20-NOV,20-DEC
0,547625,NaN,ABADEER TRAIL,NaN,78253,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,547626,NaN,ABADEER TRAIL,NaN,78253,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,547627,NaN,ABADEER TRAIL,NaN,78253,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,547628,NaN,ABADEER TRAIL,NaN,78253,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,547629,NaN,ABADEER TRAIL,NaN,78253,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
# check the shape before concatting
df1.shape

(273590, 53)

In [9]:
# check the shape before concatting
df2.shape

(274034, 53)

In [10]:
# check the shape before concatting
df3.shape

(248861, 53)

In [11]:
# Lets start putting them together
all_three = [df1, df2, df3]

In [12]:
# Now time to concat into one
all_saws = pd.concat(all_three)

In [13]:
# Check to make sure shape has 796485 rows and 53 columns
all_saws.shape

(796485, 53)

In [14]:
all_saws.head()

,Record #,Prefix,Service Location,Suffix,ZIP Code,17-JAN,17-FEB,17-MAR,17-APR,17-MAY,...,20-MAR,20-APR,20-MAY,20-JUN,20-JUL,20-AUG,20-SEP,20-OCT,20-NOV,20-DEC
0,1,NaN,2ND,ST,78221,4489,5237,4489,4489,5985,...,2244,3740,3740,2992,5237,5237,2244,3740,3740,2992
1,2,NaN,2ND,ST,78221,0,0,0,0,0,...,8229,6733,8977,10473,18702,11222,11222,8977,8229,11222
2,3,NaN,2ND,ST,78221,9725,10473,7481,7481,9725,...,6733,5237,6733,7481,8229,9725,10473,9725,8977,7481
3,4,NaN,2ND,ST,78221,2992,4489,748,1496,748,...,2244,2244,2992,2992,2992,2992,2992,2992,2244,2992
4,5,NaN,2ND,ST,78221,5237,5237,4489,5237,4489,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
# turn into csv
#all_saws.to_csv('mega_saws.csv')

## Now time to clean...

In [15]:
def fix_dates(all_saws):
    '''
    Function to fix year month column into
    datetime.  Adds arbitraty day. but keeps 
    the same month and year.  
    '''
    all_saws['datetime'] = '01-20' + all_saws['year_month']
    all_saws.datetime = pd.to_datetime(all_saws.datetime)
    return all_saws

def wrangle_saws():
    '''This function will drop unnecessary columns, 
    create a 'location' using data acquired from 
    other columns, and melt the data to make month year column'''
    # Reads the mega_saws csv
    all_saws = pd.read_csv('mega_saws.csv')
    # Removes NaN values from 'Prefix' and 'Suffix' column for concatenation in 'location'
    all_saws['Prefix'] = all_saws.Prefix.fillna(value = '')
    all_saws['Suffix'] = all_saws.Suffix.fillna(value = '')
    # Concatenating columns together for specific location
    all_saws['location'] = all_saws['Prefix'] + ' ' + all_saws['Service Location'] + ' ' + all_saws['Suffix']
    # Stripping any extra whitespace
    all_saws['location'] = all_saws.location.str.strip()
    all_saws = all_saws.drop(columns=['Unnamed: 0', 'Prefix', 'Suffix', 'Service Location'])
    #which vars should not be melted
    all_saws = all_saws.melt(id_vars=['Record #', 'ZIP Code', 'location'], 
    #var name:  the name of the column that will hold the names of the columns combined
              var_name='Month & Year', value_name='Gallons Consumed')
    all_saws = all_saws.set_index('Record #')
    all_saws = all_saws.fillna(0)
    all_saws = all_saws.rename(columns={"ZIP Code": "zipcode", 'Month & Year':'year_month', 
                                'Gallons Consumed':'gallons_consumed'})
    return fix_dates(all_saws)

### Current form issues:
- the record numbers are no longer distinct, so now there is no way to tell which house consumed the most water

In [16]:
df = wrangle_saws()

/usr/local/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3338: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):

In [17]:
df.head()

          zipcode location year_month gallons_consumed   datetime
Record #
1           78221   2ND ST     17-JAN             4489 2017-01-01
2           78221   2ND ST     17-JAN                0 2017-01-01
3           78221   2ND ST     17-JAN             9725 2017-01-01
4           78221   2ND ST     17-JAN             2992 2017-01-01
5           78221   2ND ST     17-JAN             5237 2017-01-01

In [18]:
df.shape

(38231280, 5)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38231280 entries, 1 to 796485
Data columns (total 5 columns):
 #   Column            Dtype
---  ------            -----
 0   zipcode           int64
 1   location          object
 2   year_month        object
 3   gallons_consumed  object
 4   datetime          datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 1.7+ GB

In [20]:
df.tail()

          zipcode  location year_month gallons_consumed   datetime
Record #
796481      78258   ZETA VW     20-DEC                * 2020-12-01
796482      78260  ZEUS CIR     20-DEC             2244 2020-12-01
796483      78260  ZEUS CIR     20-DEC            11222 2020-12-01
796484      78260  ZEUS CIR     20-DEC             5985 2020-12-01
796485      78260  ZEUS CIR     20-DEC             7481 2020-12-01

## Initial Exploration

In [ ]:
#explore in tableau
#df.to_csv('clean_saws.csv')

### Tableau link:

## Exploration